str1 = "Привет, "
str2 = "мир!"
result = str1 + str2
print(result)

my_string = "Пример строки"
print(my_string[0])        # Выводит первый символ
print(my_string[1:5])      # Выводит подстроку с 1 по 4 символы

x = 5
y = 2.0
print(x + y)   # Сложение
print(x - y)   # Вычитание
print(x * y)   # Умножение
print(x / y)   # Деление
print(x // y)  # Целочисленное деление
print(x % y)   # Остаток от деления

my_list = [1, 2, 3, 4, 5]
print(my_list[0])    # Выводит первый элемент списка
print(my_list[2:4])   # Выводит подсписок с 2 по 3 элементы

my_list.append(6)     # Добавление элемента в конец списка
my_list.insert(2, 10)  # Вставка элемента на позицию с индексом 2
my_list.remove(3)      # Удаление элемента со значением 3
my_list.pop()          # Удаление последнего элемента списка
