print("Добро пожаловать в мир Python!")
print("Python - это высокоуровневый язык программирования с простым синтаксисом.")


name = "Иван"
age = 25
height = 1.75

print("Привет, меня зовут", name)
print("Мне", age, "лет")
print("Мой рост -", height, "метра")

total_age = age + 5
print("Через 5 лет мне будет", total_age, "лет")


# Создание списка и добавление элементов
my_list = [10, 20, 30, 40, 50]

# Вывод списка
print("Элементы списка:", my_list)

# Изменение элемента списка
my_list[2] = 35

# Добавление нового элемента в конец списка
my_list.append(60)

# Вывод обновленного списка
print("Обновленные элементы списка:", my_list)
